export const WEBSOCKET_PUBLIC_URL = "http://localhost:5505/"
export const WEBSOCKET_SERVER_PORT = 5505

const QUIZZ_CONFIG = {
  password: "PASSWORD",
  subject: "Вопросы по ораторскому мастерству ",
  "questions": [
    {
      "question": "Кто такой оратор?",
      "answers": [
        "Человек, который, обучая кого-либо чему-либо передаёт, сообщает ему сведения из какой-либо области знания.",
        "Лицо, в какой-либо группе, организации, команде, подразделении, пользующееся большим, признанным авторитетом.",
        "Человек, который произносит речь перед аудиторией, действующий на ум и чувства слушателей."
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Из какого языка пришло слово \"оратор\"?",
      "answers": [
        "от греческого",
        "от латинского",
        "от английского"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Традиционная структура выступления делится на:",
      "answers": [
        "Вступление, кульминация, вывод",
        "Вступление, основная часть, заключение",
        "Вступление, вывод, заключение"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Где впервые появилось ораторское искусство?",
      "answers": [
        "в Древнем Риме",
        "в Древнем Китае",
        "в Древней Греции"
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Кто был первым оратором?",
      "answers": [
        "Демосфен",
        "Юлий Цезарь",
        "Омар Хайям"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Грамотные публичные выступления состоят из:",
      "answers": [
        "Диалогов и монологов",
        "Нескольких шуток",
        "Кратких речей"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Чтобы публичные выступления оказались удачными, оратор должен обладать определенными навыками и качествами, которые предусматривает ораторское искусство:",
      "answers": [
        "Грамотная самореализация",
        "Грамотная самопрезентация",
        "Уверенность в себе"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Вербальная коммуникация:",
      "answers": [
        "Диалог, монолог, выступление",
        "Мимика, жест, голос, интонация, движения",
        "Структура речи"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Что такое импровизация в речи?",
      "answers": [
        "Умение легко, спонтанно, без предварительной подготовки говорить на любую тему",
        "Умение выступать с подготовленной речью",
        "Умение находить выход в любой ситуации"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Автор первого учебника риторики на русском языке:",
      "answers": [
        "Макарий",
        "Ломоносов",
        "Рижский"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Образность речи, словесная наглядность создается при помощи:",
      "answers": [
        "силы голоса",
        "тропов",
        "жестов"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Что непозволительно для оратора по завершению его речи?",
      "answers": [
        "Кланяться, выходить на поклон",
        "Извиняться, оправдываться",
        "Аплодировать, благодарить за слушание"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Как называется вопрос, не требующий ответа?",
      "answers": [
        "Вопрос с подвохом",
        "Риторический",
        "Альтернативный"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Текст выступления должен иметь:",
      "answers": [
        "логическое начало",
        "юмористические отступления",
        "логическое завершение"
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Какое государство провозгласило риторику царицей наук?",
      "answers": [
        "Греция",
        "Италия",
        "Египет"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Определение риторики как искусства убеждать – принадлежит...",
      "answers": [
        "Квинтилиану",
        "Цицерону",
        "Аристотелю"
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Призывая греков к объединению против македонского царя, Демосфен произносил речи, названные впоследствии...",
      "answers": [
        "демосфениками",
        "филиппиками",
        "буколиками"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "В заключительной части выступления не следует говорить фразы:",
      "answers": [
        "«Это все, что я хотел сказать», «Вот и все».",
        "использовать шутку",
        "читать наизусть стихи"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Ораторство по-казахски будет...",
      "answers": [
        "суырып салма",
        "шежіре",
        "шешен өнері"
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Ораторство по-казахски будет...",
      "answers": [
        "суырып салма",
        "шежіре",
        "шешен өнері"
      ],
      "solution": 2,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Кто занимает особое место в казахском ораторском искусстве?",
      "answers": [
        "батыры",
        "бии",
        "ханы"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Какое значение имело искусство красноречия у казахского народа?",
      "answers": [
        "эстетическое",
        "политическое",
        "воспитательное"
      ],
      "solution": 1,
      "cooldown": 5,
      "time": 15
    },
    {
      "question": "Оратор и поэт, один из авторов свода законов \"Жети жаргы\", народ назвал его \"Священная ласточка\" — ...",
      "answers": [
        "Толе би",
        "Едыге би",
        "Байдалы би"
      ],
      "solution": 0,
      "cooldown": 5,
      "time": 15
    }

  ]
}

// DONT CHANGE
export const GAME_STATE_INIT = {
  started: false,
  players: [],
  playersAnswer: [],
  manager: null,
  room: null,
  currentQuestion: 0,
  roundStartTime: 0,
  ...QUIZZ_CONFIG,
}
